qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC82X/LPC82x.h

/****************************************************************************************************//**
 * @file     LPC82x.h
 *
 * @brief    CMSIS Cortex-M0PLUS Peripheral Access Layer Header File for
 *           LPC82x from .
 *
 * @version  V0.4
 * @date     17. June 2014
 *
 * @note     Generated with SVDConv V2.80 
 *           from CMSIS SVD File 'LPC82x.svd' Version 0.4,
 *******************************************************************************************************/



/** @addtogroup (null)
  * @{
  */

/** @addtogroup LPC82x
  * @{
  */

#ifndef LPC82X_H
#define LPC82X_H

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -----------------  Cortex-M0PLUS Processor Exceptions Numbers  ----------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  DebugMonitor_IRQn             =  -4,              /*!<  12  Debug Monitor                                                    */
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* ----------------------  LPC82x Specific Interrupt Numbers  --------------------- */
  SPI0_IRQn                     =   0,              /*!<   0  SPI0                                                             */
  SPI1_IRQn                     =   1,              /*!<   1  SPI1                                                             */
  UART0_IRQn                    =   3,              /*!<   3  UART0                                                            */
  UART1_IRQn                    =   4,              /*!<   4  UART1                                                            */
  UART2_IRQn                    =   5,              /*!<   5  UART2                                                            */
  I2C1_IRQn                     =   7,              /*!<   7  I2C1                                                             */
  I2C0_IRQn                     =   8,              /*!<   8  I2C0                                                             */
  SCT_IRQn                      =   9,              /*!<   9  SCT                                                              */
  MRT_IRQn                      =  10,              /*!<  10  MRT                                                              */
  CMP_IRQn                      =  11,              /*!<  11  CMP                                                              */
  WDT_IRQn                      =  12,              /*!<  12  WDT                                                              */
  BOD_IRQn                      =  13,              /*!<  13  BOD                                                              */
  FLASH_IRQn                    =  14,              /*!<  14  FLASH                                                            */
  WKT_IRQn                      =  15,              /*!<  15  WKT                                                              */
  ADC_SEQA_IRQn                 =  16,              /*!<  16  ADC_SEQA                                                         */
  ADC_SEQB_IRQn                 =  17,              /*!<  17  ADC_SEQB                                                         */
  ADC_THCMP_IRQn                =  18,              /*!<  18  ADC_THCMP                                                        */
  ADC_OVR_IRQn                  =  19,              /*!<  19  ADC_OVR                                                          */
  DMA_IRQn                      =  20,              /*!<  20  DMA                                                              */
  I2C2_IRQn                     =  21,              /*!<  21  I2C2                                                             */
  I2C3_IRQn                     =  22,              /*!<  22  I2C3                                                             */
  PIN_INT0_IRQn                 =  24,              /*!<  24  PIN_INT0                                                         */
  PIN_INT1_IRQn                 =  25,              /*!<  25  PIN_INT1                                                         */
  PIN_INT2_IRQn                 =  26,              /*!<  26  PIN_INT2                                                         */
  PIN_INT3_IRQn                 =  27,              /*!<  27  PIN_INT3                                                         */
  PIN_INT4_IRQn                 =  28,              /*!<  28  PIN_INT4                                                         */
  PIN_INT5_IRQn                 =  29,              /*!<  29  PIN_INT5                                                         */
  PIN_INT6_IRQn                 =  30,              /*!<  30  PIN_INT6                                                         */
  PIN_INT7_IRQn                 =  31               /*!<  31  PIN_INT7                                                         */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M0PLUS Processor and Core Peripherals---------------- */
#define __CM0PLUS_REV                 0x0001        /*!< Cortex-M0PLUS Core Revision                                           */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
#define __VTOR_PRESENT                 1            /*!< Set to 1 if CPU supports Vector Table Offset Register                 */
/** @} */ /* End of group Configuration_of_CMSIS */

