qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC82X/LPC82x.h
typedef struct {                                    /*!< (@ 0x40008000) WKT Structure                                          */
  __IO uint32_t  CTRL;                              /*!< (@ 0x40008000) Self wake-up timer control register.                   */
  __I  uint32_t  RESERVED0[2];
  __IO uint32_t  COUNT;                             /*!< (@ 0x4000800C) Counter register.                                      */
} LPC_WKT_Type;


/* ================================================================================ */
/* ================                       SWM                      ================ */
/* ================================================================================ */


/**
  * @brief Switch matrix (SWM) (SWM)
  */

typedef struct {                                    /*!< (@ 0x4000C000) SWM Structure                                          */
  union {
    __IO uint32_t PINASSIGN[12];
    struct {
      __IO uint32_t  PINASSIGN0;                    /*!< (@ 0x4000C000) Pin assign register 0. Assign movable functions
                                                         U0_TXD, U0_RXD, U0_RTS, U0_CTS.                                       */
      __IO uint32_t  PINASSIGN1;                    /*!< (@ 0x4000C004) Pin assign register 1. Assign movable functions
                                                         U0_SCLK, U1_TXD, U1_RXD, U1_RTS.                                      */
      __IO uint32_t  PINASSIGN2;                    /*!< (@ 0x4000C008) Pin assign register 2. Assign movable functions
                                                         U1_CTS, U1_SCLK, U2_TXD, U2_RXD.                                      */
      __IO uint32_t  PINASSIGN3;                    /*!< (@ 0x4000C00C) Pin assign register 3. Assign movable function
                                                         U2_RTS, U2_CTS, U2_SCLK, SPI0_SCK.                                    */
      __IO uint32_t  PINASSIGN4;                    /*!< (@ 0x4000C010) Pin assign register 4. Assign movable functions
                                                         SPI0_MOSI, SPI0_MISO, SPI0_SSEL0, SPI0_SSEL1.                         */
      __IO uint32_t  PINASSIGN5;                    /*!< (@ 0x4000C014) Pin assign register 5. Assign movable functions
                                                         SPI0_SSEL2, SPI0_SSEL3, SPI1_SCK, SPI1_MOSI                           */
      __IO uint32_t  PINASSIGN6;                    /*!< (@ 0x4000C018) Pin assign register 6. Assign movable functions
                                                         SPI1_MISO, SPI1_SSEL0, SPI1_SSEL1, SCT0_IN0.                          */
      __IO uint32_t  PINASSIGN7;                    /*!< (@ 0x4000C01C) Pin assign register 7. Assign movable functions
                                                         SCT_IN1, SCT_IN2, SCT_IN3, SCT_OUT0.                                  */
      __IO uint32_t  PINASSIGN8;                    /*!< (@ 0x4000C020) Pin assign register 8. Assign movable functions
                                                         SCT_OUT1, SCT_OUT2, SCT_OUT3, SCT_OUT4.                               */
      __IO uint32_t  PINASSIGN9;                    /*!< (@ 0x4000C024) Pin assign register 9. Assign movable functions
                                                         SCT_OUT5, I2C1_SDA, I2C1_SCL, I2C2_SDA.                               */
      __IO uint32_t  PINASSIGN10;                   /*!< (@ 0x4000C028) Pin assign register 10. Assign movable functions
                                                         I2C2_SCL, I2C3_SDA, I2C3_SCL, ADC_PINTRIG0.                           */
      __IO uint32_t  PINASSIGN11;                   /*!< (@ 0x4000C02C) Pin assign register 11. Assign movable functions
                                                         ADC_PINTRIG1, ACMP_O, CLKOUT, GPIO_INT_BMAT                           */
    };
  };
  __I  uint32_t  RESERVED0[100];
  __IO uint32_t  PINENABLE0;                        /*!< (@ 0x4000C1C0) Pin enable register 0. Enables fixed-pin functions
                                                         ACMP_I0, ACMP_I1, SWCLK, SWDIO, XTALIN, XTALOUT, RESET, CLKIN,
                                                          VDDCMP.                                                              */
} LPC_SWM_Type;


/* ================================================================================ */
/* ================                       ADC                      ================ */
/* ================================================================================ */


/**
  * @brief 12-bit Analog-to-Digital Converter (ADC) (ADC)
  */

typedef struct {                                    /*!< (@ 0x4001C000) ADC Structure                                          */
  __IO uint32_t  CTRL;                              /*!< (@ 0x4001C000) A/D Control Register. Contains the clock divide
                                                         value, enable bits for each sequence and the A/D power-down
                                                          bit.                                                                 */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  SEQA_CTRL;                         /*!< (@ 0x4001C008) A/D Conversion Sequence-A control Register: Controls
                                                         triggering and channel selection for conversion sequence-A.
                                                          Also specifies interrupt mode for sequence-A.                        */
  __IO uint32_t  SEQB_CTRL;                         /*!< (@ 0x4001C00C) A/D Conversion Sequence-B Control Register: Controls
                                                         triggering and channel selection for conversion sequence-B.
                                                          Also specifies interrupt mode for sequence-B.                        */
  __IO uint32_t  SEQA_GDAT;                         /*!< (@ 0x4001C010) A/D Sequence-A Global Data Register. This register
                                                         contains the result of the most recent A/D conversion performed
                                                          under sequence-A                                                     */
  __IO uint32_t  SEQB_GDAT;                         /*!< (@ 0x4001C014) A/D Sequence-B Global Data Register. This register
                                                         contains the result of the most recent A/D conversion performed
                                                          under sequence-B                                                     */
  __I  uint32_t  RESERVED1[2];
  __I  uint32_t  DAT0;                              /*!< (@ 0x4001C020) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT1;                              /*!< (@ 0x4001C024) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT2;                              /*!< (@ 0x4001C028) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT3;                              /*!< (@ 0x4001C02C) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT4;                              /*!< (@ 0x4001C030) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT5;                              /*!< (@ 0x4001C034) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT6;                              /*!< (@ 0x4001C038) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT7;                              /*!< (@ 0x4001C03C) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT8;                              /*!< (@ 0x4001C040) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT9;                              /*!< (@ 0x4001C044) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT10;                             /*!< (@ 0x4001C048) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __I  uint32_t  DAT11;                             /*!< (@ 0x4001C04C) A/D Channel 0 Data Register. This register contains
                                                         the result of the most recent conversion completed on channel
                                                          0.                                                                   */
  __IO uint32_t  THR0_LOW;                          /*!< (@ 0x4001C050) A/D Low Compare Threshold Register 0 : Contains
                                                         the lower threshold level for automatic threshold comparison
                                                          for any channels linked to threshold pair 0.                         */
  __IO uint32_t  THR1_LOW;                          /*!< (@ 0x4001C054) A/D Low Compare Threshold Register 1: Contains
                                                         the lower threshold level for automatic threshold comparison
                                                          for any channels linked to threshold pair 1.                         */
  __IO uint32_t  THR0_HIGH;                         /*!< (@ 0x4001C058) A/D High Compare Threshold Register 0: Contains
                                                         the upper threshold level for automatic threshold comparison
                                                          for any channels linked to threshold pair 0.                         */
  __IO uint32_t  THR1_HIGH;                         /*!< (@ 0x4001C05C) A/D High Compare Threshold Register 1: Contains
                                                         the upper threshold level for automatic threshold comparison
                                                          for any channels linked to threshold pair 1.                         */
  __IO uint32_t  CHAN_THRSEL;                       /*!< (@ 0x4001C060) A/D Channel-Threshold Select Register. Specifies
                                                         which set of threshold compare registers are to be used for
                                                          each channel                                                         */
  __IO uint32_t  INTEN;                             /*!< (@ 0x4001C064) A/D Interrupt Enable Register. This register
                                                         contains enable bits that enable the sequence-A, sequence-B,
                                                          threshold compare and data overrun interrupts to be generated.       */
  __IO uint32_t  FLAGS;                             /*!< (@ 0x4001C068) A/D Flags Register. Contains the four interrupt
                                                         request flags and the individual component overrun and threshold-compare
                                                          flags. (The overrun bits replicate information stored in the
                                                          result registers).                                                   */
  __IO uint32_t  TRM;                               /*!< (@ 0x4001C06C) ADC trim register.                                     */
} LPC_ADC_Type;


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */


/**
  * @brief Power Management Unit (PMU) (PMU)
  */

typedef struct {                                    /*!< (@ 0x40020000) PMU Structure                                          */
  __IO uint32_t  PCON;                              /*!< (@ 0x40020000) Power control register                                 */
  __IO uint32_t  GPREG0;                            /*!< (@ 0x40020004) General purpose register 0                             */
  __IO uint32_t  GPREG1;                            /*!< (@ 0x40020008) General purpose register 0                             */
  __IO uint32_t  GPREG2;                            /*!< (@ 0x4002000C) General purpose register 0                             */
  __IO uint32_t  GPREG3;                            /*!< (@ 0x40020010) General purpose register 0                             */
  __IO uint32_t  DPDCTRL;                           /*!< (@ 0x40020014) Deep power-down control register. Also includes
                                                         bits for general purpose storage.                                     */
} LPC_PMU_Type;


/* ================================================================================ */
/* ================                       CMP                      ================ */
/* ================================================================================ */


/**
  * @brief Analog comparator (CMP)
  */

typedef struct {                                    /*!< (@ 0x40024000) CMP Structure                                          */
  __IO uint32_t  CTRL;                              /*!< (@ 0x40024000) Comparator control register                            */
  __IO uint32_t  LAD;                               /*!< (@ 0x40024004) Voltage ladder register                                */
} LPC_CMP_Type;


/* ================================================================================ */
/* ================                   DMATRIGMUX                   ================ */
/* ================================================================================ */


/**
  * @brief DMA trigger mux (DMATRIGMUX)
  */

