qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC82X/LPC82x.h
typedef struct {                                    /*!< (@ 0x40028000) DMATRIGMUX Structure                                   */
  __IO uint32_t  DMA_ITRIG_INMUX0;                  /*!< (@ 0x40028000) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX1;                  /*!< (@ 0x40028004) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX2;                  /*!< (@ 0x40028008) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX3;                  /*!< (@ 0x4002800C) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX4;                  /*!< (@ 0x40028010) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX5;                  /*!< (@ 0x40028014) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX6;                  /*!< (@ 0x40028018) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX7;                  /*!< (@ 0x4002801C) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX8;                  /*!< (@ 0x40028020) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX9;                  /*!< (@ 0x40028024) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX10;                 /*!< (@ 0x40028028) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX11;                 /*!< (@ 0x4002802C) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX12;                 /*!< (@ 0x40028030) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX13;                 /*!< (@ 0x40028034) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX14;                 /*!< (@ 0x40028038) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX15;                 /*!< (@ 0x4002803C) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX16;                 /*!< (@ 0x40028040) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
  __IO uint32_t  DMA_ITRIG_INMUX17;                 /*!< (@ 0x40028044) Input mux register for trigger inputs 0 to 23
                                                         connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin
                                                          interrupts, and DMA requests.                                        */
} LPC_DMATRIGMUX_Type;


/* ================================================================================ */
/* ================                    INPUTMUX                    ================ */
/* ================================================================================ */


/**
  * @brief Input multiplexing  (INPUTMUX)
  */

typedef struct {                                    /*!< (@ 0x4002C000) INPUTMUX Structure                                     */
  __IO uint32_t  DMA_INMUX_INMUX0;                  /*!< (@ 0x4002C000) Input mux register for DMA trigger input 20.
                                                         Selects from 18 DMA trigger outputs.                                  */
  __IO uint32_t  DMA_INMUX_INMUX1;                  /*!< (@ 0x4002C004) Input mux register for DMA trigger input 20.
                                                         Selects from 18 DMA trigger outputs.                                  */
  __I  uint32_t  RESERVED0[6];
  __IO uint32_t  SCT0_INMUX0;                       /*!< (@ 0x4002C020) Input mux register for SCT input 0                     */
  __IO uint32_t  SCT0_INMUX1;                       /*!< (@ 0x4002C024) Input mux register for SCT input 0                     */
  __IO uint32_t  SCT0_INMUX2;                       /*!< (@ 0x4002C028) Input mux register for SCT input 0                     */
  __IO uint32_t  SCT0_INMUX3;                       /*!< (@ 0x4002C02C) Input mux register for SCT input 0                     */
} LPC_INPUTMUX_Type;


/* ================================================================================ */
/* ================                    FLASHCTRL                   ================ */
/* ================================================================================ */


/**
  * @brief Flash controller  (FLASHCTRL)
  */

typedef struct {                                    /*!< (@ 0x40040000) FLASHCTRL Structure                                    */
  __I  uint32_t  RESERVED0[4];
  __IO uint32_t  FLASHCFG;                          /*!< (@ 0x40040010) Flash configuration register                           */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  FMSSTART;                          /*!< (@ 0x40040020) Signature start address register                       */
  __IO uint32_t  FMSSTOP;                           /*!< (@ 0x40040024) Signature stop-address register                        */
  __I  uint32_t  RESERVED2;
  __I  uint32_t  FMSW0;                             /*!< (@ 0x4004002C) Signature Word                                         */
} LPC_FLASHCTRL_Type;


/* ================================================================================ */
/* ================                      IOCON                     ================ */
/* ================================================================================ */


/**
  * @brief I/O configuration (IOCON) (IOCON)
  */

typedef struct {                                    /*!< (@ 0x40044000) IOCON Structure                                        */
  __IO uint32_t  PIO0_17;                           /*!< (@ 0x40044000) I/O configuration for pin PIO0_17                      */
  __IO uint32_t  PIO0_13;                           /*!< (@ 0x40044004) I/O configuration for pin PIO0_13                      */
  __IO uint32_t  PIO0_12;                           /*!< (@ 0x40044008) I/O configuration for pin PIO0_12                      */
  __IO uint32_t  PIO0_5;                            /*!< (@ 0x4004400C) I/O configuration for pin PIO0_5/RESET                 */
  __IO uint32_t  PIO0_4;                            /*!< (@ 0x40044010) I/O configuration for pin PIO0_4                       */
  __IO uint32_t  PIO0_3;                            /*!< (@ 0x40044014) I/O configuration for pin PIO0_3/SWCLK                 */
  __IO uint32_t  PIO0_2;                            /*!< (@ 0x40044018) I/O configuration for pin PIO0_2/SWDIO                 */
  __IO uint32_t  PIO0_11;                           /*!< (@ 0x4004401C) I/O configuration for pin PIO0_11. This is the
                                                         pin configuration for the true open-drain pin.                        */
  __IO uint32_t  PIO0_10;                           /*!< (@ 0x40044020) I/O configuration for pin PIO0_10. This is the
                                                         pin configuration for the true open-drain pin.                        */
  __IO uint32_t  PIO0_16;                           /*!< (@ 0x40044024) I/O configuration for pin PIO0_16                      */
  __IO uint32_t  PIO0_15;                           /*!< (@ 0x40044028) I/O configuration for pin PIO0_15                      */
  __IO uint32_t  PIO0_1;                            /*!< (@ 0x4004402C) I/O configuration for pin PIO0_17                      */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  PIO0_9;                            /*!< (@ 0x40044034) I/O configuration for pin PIO0_9/XTALOUT               */
  __IO uint32_t  PIO0_8;                            /*!< (@ 0x40044038) I/O configuration for pin PIO0_8/XTALIN                */
  __IO uint32_t  PIO0_7;                            /*!< (@ 0x4004403C) I/O configuration for pin PIO0_7                       */
  __IO uint32_t  PIO0_6;                            /*!< (@ 0x40044040) I/O configuration for pin PIO0_6/VDDCMP                */
  __IO uint32_t  PIO0_0;                            /*!< (@ 0x40044044) I/O configuration for pin PIO0_0/ACMP_I0               */
  __IO uint32_t  PIO0_14;                           /*!< (@ 0x40044048) I/O configuration for pin PIO0_14                      */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  PIO0_28;                           /*!< (@ 0x40044050) I/O configuration for pin PIO0_28                      */
  __IO uint32_t  PIO0_27;                           /*!< (@ 0x40044054) I/O configuration for pin PIO0_27                      */
  __IO uint32_t  PIO0_26;                           /*!< (@ 0x40044058) I/O configuration for pin PIO0_26                      */
  __IO uint32_t  PIO0_25;                           /*!< (@ 0x4004405C) I/O configuration for pin PIO0_25                      */
  __IO uint32_t  PIO0_24;                           /*!< (@ 0x40044060) I/O configuration for pin PIO0_24                      */
  __IO uint32_t  PIO0_23;                           /*!< (@ 0x40044064) I/O configuration for pin PIO0_23/ADC_3                */
  __IO uint32_t  PIO0_22;                           /*!< (@ 0x40044068) I/O configuration for pin PIO0_22/ADC_4                */
  __IO uint32_t  PIO0_21;                           /*!< (@ 0x4004406C) I/O configuration for pin PIO0_21/ACMP_I4/ADC_5        */
  __IO uint32_t  PIO0_20;                           /*!< (@ 0x40044070) I/O configuration for pin PIO0_20/ADC_6                */
  __IO uint32_t  PIO0_19;                           /*!< (@ 0x40044074) I/O configuration for pin PIO0_19/ADC_7                */
  __IO uint32_t  PIO0_18;                           /*!< (@ 0x40044078) I/O configuration for pin PIO0_18/ADC_8                */
} LPC_IOCON_Type;


/* ================================================================================ */
/* ================                     SYSCON                     ================ */
/* ================================================================================ */


/**
  * @brief System configuration (SYSCON) (SYSCON)
  */

typedef struct {                                    /*!< (@ 0x40048000) SYSCON Structure                                       */
  __IO uint32_t  SYSMEMREMAP;                       /*!< (@ 0x40048000) System memory remap                                    */
  __IO uint32_t  PRESETCTRL;                        /*!< (@ 0x40048004) Peripheral reset control                               */
  __IO uint32_t  SYSPLLCTRL;                        /*!< (@ 0x40048008) System PLL control                                     */
  __I  uint32_t  SYSPLLSTAT;                        /*!< (@ 0x4004800C) System PLL status                                      */
  __I  uint32_t  RESERVED0[4];
  __IO uint32_t  SYSOSCCTRL;                        /*!< (@ 0x40048020) System oscillator control                              */
  __IO uint32_t  WDTOSCCTRL;                        /*!< (@ 0x40048024) Watchdog oscillator control                            */
  __IO uint32_t  IRCCTRL;                           /*!< (@ 0x40048028) IRC control                                            */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  SYSRSTSTAT;                        /*!< (@ 0x40048030) System reset status register                           */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  SYSPLLCLKSEL;                      /*!< (@ 0x40048040) System PLL clock source select                         */
  __IO uint32_t  SYSPLLCLKUEN;                      /*!< (@ 0x40048044) System PLL clock source update enable                  */
  __I  uint32_t  RESERVED3[10];
  __IO uint32_t  MAINCLKSEL;                        /*!< (@ 0x40048070) Main clock source select                               */
  __IO uint32_t  MAINCLKUEN;                        /*!< (@ 0x40048074) Main clock source update enable                        */
  __IO uint32_t  SYSAHBCLKDIV;                      /*!< (@ 0x40048078) System clock divider                                   */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  SYSAHBCLKCTRL;                     /*!< (@ 0x40048080) System clock control                                   */
  __I  uint32_t  RESERVED5[4];
  __IO uint32_t  UARTCLKDIV;                        /*!< (@ 0x40048094) USART clock divider                                    */
  __I  uint32_t  RESERVED6[18];
  __IO uint32_t  CLKOUTSEL;                         /*!< (@ 0x400480E0) CLKOUT clock source select                             */
  __IO uint32_t  CLKOUTUEN;                         /*!< (@ 0x400480E4) CLKOUT clock source update enable                      */
  __IO uint32_t  CLKOUTDIV;                         /*!< (@ 0x400480E8) CLKOUT clock divider                                   */
  __I  uint32_t  RESERVED7;
  __IO uint32_t  UARTFRGDIV;                        /*!< (@ 0x400480F0) USART1 to USART4 common fractional generator
                                                         divider value                                                         */
  __IO uint32_t  UARTFRGMULT;                       /*!< (@ 0x400480F4) USART1 to USART4 common fractional generator
                                                         multiplier value                                                      */
  __I  uint32_t  RESERVED8;
  __IO uint32_t  EXTTRACECMD;                       /*!< (@ 0x400480FC) External trace buffer command register                 */
  __I  uint32_t  PIOPORCAP0;                        /*!< (@ 0x40048100) POR captured PIO status 0                              */
  __I  uint32_t  RESERVED9[12];
  __IO uint32_t  IOCONCLKDIV6;                      /*!< (@ 0x40048134) Peripheral clock 6 to the IOCON block for programmable
                                                         glitch filter                                                         */
  __I  uint32_t  RESERVED10[6];
  __IO uint32_t  BODCTRL;                           /*!< (@ 0x40048150) Brown-Out Detect                                       */
  __IO uint32_t  SYSTCKCAL;                         /*!< (@ 0x40048154) System tick counter calibration                        */
  __I  uint32_t  RESERVED11[6];
  __IO uint32_t  IRQLATENCY;                        /*!< (@ 0x40048170) IQR delay. Allows trade-off between interrupt
                                                         latency and determinism.                                              */
  __IO uint32_t  NMISRC;                            /*!< (@ 0x40048174) NMI Source Control                                     */
  union {
    __IO uint32_t  PINTSEL[8];
  struct {
  __IO uint32_t  PINTSEL0;                          /*!< (@ 0x40048178) GPIO Pin Interrupt Select register 0                   */
  __IO uint32_t  PINTSEL1;                          /*!< (@ 0x4004817C) GPIO Pin Interrupt Select register 0                   */
  __IO uint32_t  PINTSEL2;                          /*!< (@ 0x40048180) GPIO Pin Interrupt Select register 0                   */
  __IO uint32_t  PINTSEL3;                          /*!< (@ 0x40048184) GPIO Pin Interrupt Select register 0                   */
  __IO uint32_t  PINTSEL4;                          /*!< (@ 0x40048188) GPIO Pin Interrupt Select register 0                   */
  __IO uint32_t  PINTSEL5;                          /*!< (@ 0x4004818C) GPIO Pin Interrupt Select register 0                   */
  __IO uint32_t  PINTSEL6;                          /*!< (@ 0x40048190) GPIO Pin Interrupt Select register 0                   */
  __IO uint32_t  PINTSEL7;                          /*!< (@ 0x40048194) GPIO Pin Interrupt Select register 0                   */
  };
  };
  __I  uint32_t  RESERVED12[27];
  __IO uint32_t  STARTERP0;                         /*!< (@ 0x40048204) Start logic 0 pin wake-up enable register              */
  __I  uint32_t  RESERVED13[3];
  __IO uint32_t  STARTERP1;                         /*!< (@ 0x40048214) Start logic 1 interrupt wake-up enable register        */
  __I  uint32_t  RESERVED14[6];
  __IO uint32_t  PDSLEEPCFG;                        /*!< (@ 0x40048230) Power-down states in deep-sleep mode                   */
  __IO uint32_t  PDAWAKECFG;                        /*!< (@ 0x40048234) Power-down states for wake-up from deep-sleep          */
  __IO uint32_t  PDRUNCFG;                          /*!< (@ 0x40048238) Power configuration register                           */
  __I  uint32_t  RESERVED15[111];
  __I  uint32_t  DEVICE_ID;                         /*!< (@ 0x400483F8) Device ID                                              */
} LPC_SYSCON_Type;


/* ================================================================================ */
/* ================                      I2C0                      ================ */
/* ================================================================================ */


/**
  * @brief I2C0-bus interface (I2C0)
  */

