qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC82X/LPC82x.h
typedef struct {                                    /*!< (@ 0x40050000) I2C0 Structure                                         */
  __IO uint32_t  CFG;                               /*!< (@ 0x40050000) Configuration for shared functions.                    */
  __IO uint32_t  STAT;                              /*!< (@ 0x40050004) Status register for Master, Slave, and Monitor
                                                         functions.                                                            */
  __IO uint32_t  INTENSET;                          /*!< (@ 0x40050008) Interrupt Enable Set and read register.                */
  __O  uint32_t  INTENCLR;                          /*!< (@ 0x4005000C) Interrupt Enable Clear register.                       */
  __IO uint32_t  TIMEOUT;                           /*!< (@ 0x40050010) Time-out value register.                               */
  __IO uint32_t  CLKDIV;                            /*!< (@ 0x40050014) Clock pre-divider for the entire I2C block. This
                                                         determines what time increments are used for the MSTTIME and
                                                          SLVTIME registers.                                                   */
  __I  uint32_t  INTSTAT;                           /*!< (@ 0x40050018) Interrupt Status register for Master, Slave,
                                                         and Monitor functions.                                                */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  MSTCTL;                            /*!< (@ 0x40050020) Master control register.                               */
  __IO uint32_t  MSTTIME;                           /*!< (@ 0x40050024) Master timing configuration.                           */
  __IO uint32_t  MSTDAT;                            /*!< (@ 0x40050028) Combined Master receiver and transmitter data
                                                         register.                                                             */
  __I  uint32_t  RESERVED1[5];
  __IO uint32_t  SLVCTL;                            /*!< (@ 0x40050040) Slave control register.                                */
  __IO uint32_t  SLVDAT;                            /*!< (@ 0x40050044) Combined Slave receiver and transmitter data
                                                         register.                                                             */
  union {
    __IO uint32_t SLVADR[4];
    struct {
  __IO uint32_t  SLVADR0;                           /*!< (@ 0x40050048) Slave address 0.                                       */
  __IO uint32_t  SLVADR1;                           /*!< (@ 0x4005004C) Slave address 0.                                       */
  __IO uint32_t  SLVADR2;                           /*!< (@ 0x40050050) Slave address 0.                                       */
  __IO uint32_t  SLVADR3;                           /*!< (@ 0x40050054) Slave address 0.                                       */
    };
  };
  __IO uint32_t  SLVQUAL0;                          /*!< (@ 0x40050058) Slave Qualification for address 0.                     */
  __I  uint32_t  RESERVED2[9];
  __I  uint32_t  MONRXDAT;                          /*!< (@ 0x40050080) Monitor receiver data register.                        */
} LPC_I2C0_Type;


/* ================================================================================ */
/* ================                      SPI0                      ================ */
/* ================================================================================ */


/**
  * @brief SPI0 (SPI0)
  */

typedef struct {                                    /*!< (@ 0x40058000) SPI0 Structure                                         */
  __IO uint32_t  CFG;                               /*!< (@ 0x40058000) SPI Configuration register                             */
  __IO uint32_t  DLY;                               /*!< (@ 0x40058004) SPI Delay register                                     */
  __IO uint32_t  STAT;                              /*!< (@ 0x40058008) SPI Status. Some status flags can be cleared
                                                         by writing a 1 to that bit position                                   */
  __IO uint32_t  INTENSET;                          /*!< (@ 0x4005800C) SPI Interrupt Enable read and Set. A complete
                                                         value may be read from this register. Writing a 1 to any implemented
                                                          bit position causes that bit to be set.                              */
  __O  uint32_t  INTENCLR;                          /*!< (@ 0x40058010) SPI Interrupt Enable Clear. Writing a 1 to any
                                                         implemented bit position causes the corresponding bit in INTENSET
                                                          to be cleared.                                                       */
  __I  uint32_t  RXDAT;                             /*!< (@ 0x40058014) SPI Receive Data                                       */
  __IO uint32_t  TXDATCTL;                          /*!< (@ 0x40058018) SPI Transmit Data with Control                         */
  __IO uint32_t  TXDAT;                             /*!< (@ 0x4005801C) SPI Transmit Data                                      */
  __IO uint32_t  TXCTL;                             /*!< (@ 0x40058020) SPI Transmit Control                                   */
  __IO uint32_t  DIV;                               /*!< (@ 0x40058024) SPI clock Divider                                      */
  __I  uint32_t  INTSTAT;                           /*!< (@ 0x40058028) SPI Interrupt Status                                   */
} LPC_SPI0_Type;


/* ================================================================================ */
/* ================                     USART0                     ================ */
/* ================================================================================ */


/**
  * @brief USART0 (USART0)
  */

typedef struct {                                    /*!< (@ 0x40064000) USART0 Structure                                       */
  __IO uint32_t  CFG;                               /*!< (@ 0x40064000) USART Configuration register. Basic USART configuration
                                                         settings that typically are not changed during operation.             */
  __IO uint32_t  CTL;                               /*!< (@ 0x40064004) USART Control register. USART control settings
                                                         that are more likely to change during operation.                      */
  __IO uint32_t  STAT;                              /*!< (@ 0x40064008) USART Status register. The complete status value
                                                         can be read here. Writing ones clears some bits in the register.
                                                          Some bits can be cleared by writing a 1 to them.                     */
  __IO uint32_t  INTENSET;                          /*!< (@ 0x4006400C) Interrupt Enable read and Set register. Contains
                                                         an individual interrupt enable bit for each potential USART
                                                          interrupt. A complete value may be read from this register.
                                                          Writing a 1 to any implemented bit position causes that bit
                                                          to be set.                                                           */
  __O  uint32_t  INTENCLR;                          /*!< (@ 0x40064010) Interrupt Enable Clear register. Allows clearing
                                                         any combination of bits in the INTENSET register. Writing a
                                                          1 to any implemented bit position causes the corresponding bit
                                                          to be cleared.                                                       */
  __I  uint32_t  RXDAT;                             /*!< (@ 0x40064014) Receiver Data register. Contains the last character
                                                         received.                                                             */
  __I  uint32_t  RXDATSTAT;                         /*!< (@ 0x40064018) Receiver Data with Status register. Combines
                                                         the last character received with the current USART receive status.
                                                          Allows DMA or software to recover incoming data and status together. */
  __IO uint32_t  TXDAT;                             /*!< (@ 0x4006401C) Transmit Data register. Data to be transmitted
                                                         is written here.                                                      */
  __IO uint32_t  BRG;                               /*!< (@ 0x40064020) Baud Rate Generator register. 16-bit integer
                                                         baud rate divisor value.                                              */
  __I  uint32_t  INTSTAT;                           /*!< (@ 0x40064024) Interrupt status register. Reflects interrupts
                                                         that are currently enabled.                                           */
  __IO uint32_t  OSR;                               /*!< (@ 0x40064028) Oversample selection register for asynchronous
                                                         communication.                                                        */
  __IO uint32_t  ADDR;                              /*!< (@ 0x4006402C) Address register for automatic address matching.       */
} LPC_USART0_Type;


/* ================================================================================ */
/* ================                       CRC                      ================ */
/* ================================================================================ */


/**
  * @brief Cyclic Redundancy Check (CRC) engine (CRC)
  */

typedef struct {                                    /*!< (@ 0x50000000) CRC Structure                                          */
  __IO uint32_t  MODE;                              /*!< (@ 0x50000000) CRC mode register                                      */
  __IO uint32_t  SEED;                              /*!< (@ 0x50000004) CRC seed register                                      */
  
  union {
    __O  uint32_t  WR_DATA;                         /*!< (@ 0x50000008) CRC data register                                      */
    __I  uint32_t  SUM;                             /*!< (@ 0x50000008) CRC checksum register                                  */
  };
} LPC_CRC_Type;


/* ================================================================================ */
/* ================                       SCT                      ================ */
/* ================================================================================ */


/**
  * @brief State Configurable Timer (SCT) (SCT)
  */

typedef struct {                                    /*!< (@ 0x50004000) SCT Structure                                          */
  __IO uint32_t  CONFIG;                            /*!< (@ 0x50004000) SCT configuration register                             */
  __IO uint32_t  CTRL;                              /*!< (@ 0x50004004) SCT control register                                   */
  __IO uint32_t  LIMIT;                             /*!< (@ 0x50004008) SCT limit register                                     */
  __IO uint32_t  HALT;                              /*!< (@ 0x5000400C) SCT halt condition register                            */
  __IO uint32_t  STOP;                              /*!< (@ 0x50004010) SCT stop condition register                            */
  __IO uint32_t  START;                             /*!< (@ 0x50004014) SCT start condition register                           */
  __I  uint32_t  RESERVED0[10];
  __IO uint32_t  COUNT;                             /*!< (@ 0x50004040) SCT counter register                                   */
  __IO uint32_t  STATE;                             /*!< (@ 0x50004044) SCT state register                                     */
  __I  uint32_t  INPUT;                             /*!< (@ 0x50004048) SCT input register                                     */
  __IO uint32_t  REGMODE;                           /*!< (@ 0x5000404C) SCT match/capture registers mode register              */
  __IO uint32_t  OUTPUT;                            /*!< (@ 0x50004050) SCT output register                                    */
  __IO uint32_t  OUTPUTDIRCTRL;                     /*!< (@ 0x50004054) SCT output counter direction control register          */
  __IO uint32_t  RES;                               /*!< (@ 0x50004058) SCT conflict resolution register                       */
  __IO uint32_t  DMAREQ0;                           /*!< (@ 0x5000405C) SCT DMA request 0 register                             */
  __IO uint32_t  DMAREQ1;                           /*!< (@ 0x50004060) SCT DMA request 1 register                             */
  __I  uint32_t  RESERVED1[35];
  __IO uint32_t  EVEN;                              /*!< (@ 0x500040F0) SCT event enable register                              */
  __IO uint32_t  EVFLAG;                            /*!< (@ 0x500040F4) SCT event flag register                                */
  __IO uint32_t  CONEN;                             /*!< (@ 0x500040F8) SCT conflict enable register                           */
  __IO uint32_t  CONFLAG;                           /*!< (@ 0x500040FC) SCT conflict flag register                             */
  
union {
  union {
    __IO uint32_t  CAP0;                            /*!< (@ 0x50004100) SCT capture register of capture channel 0 to
                                                         7; REGMOD0 to REGMODE7 = 1                                            */
    __IO uint32_t  MATCH0;                          /*!< (@ 0x50004100) SCT match value register of match channels 0
                                                         to 7; REGMOD0 to REGMODE7 = 0                                         */
  };
  
  union {
    __IO uint32_t  CAP1;                            /*!< (@ 0x50004104) SCT capture register of capture channel 0 to
                                                         7; REGMOD0 to REGMODE7 = 1                                            */
    __IO uint32_t  MATCH1;                          /*!< (@ 0x50004104) SCT match value register of match channels 0
                                                         to 7; REGMOD0 to REGMODE7 = 0                                         */
  };
  
  union {
    __IO uint32_t  CAP2;                            /*!< (@ 0x50004108) SCT capture register of capture channel 0 to
                                                         7; REGMOD0 to REGMODE7 = 1                                            */
    __IO uint32_t  MATCH2;                          /*!< (@ 0x50004108) SCT match value register of match channels 0
                                                         to 7; REGMOD0 to REGMODE7 = 0                                         */
  };
  
  union {
    __IO uint32_t  MATCH3;                          /*!< (@ 0x5000410C) SCT match value register of match channels 0
                                                         to 7; REGMOD0 to REGMODE7 = 0                                         */
    __IO uint32_t  CAP3;                            /*!< (@ 0x5000410C) SCT capture register of capture channel 0 to
                                                         7; REGMOD0 to REGMODE7 = 1                                            */
  };
  
  union {
    __IO uint32_t  CAP4;                            /*!< (@ 0x50004110) SCT capture register of capture channel 0 to
                                                         7; REGMOD0 to REGMODE7 = 1                                            */
    __IO uint32_t  MATCH4;                          /*!< (@ 0x50004110) SCT match value register of match channels 0
                                                         to 7; REGMOD0 to REGMODE7 = 0                                         */
  };
  
  union {
    __IO uint32_t  MATCH5;                          /*!< (@ 0x50004114) SCT match value register of match channels 0
                                                         to 7; REGMOD0 to REGMODE7 = 0                                         */
    __IO uint32_t  CAP5;                            /*!< (@ 0x50004114) SCT capture register of capture channel 0 to
                                                         7; REGMOD0 to REGMODE7 = 1                                            */
  };
  
  union {
    __IO uint32_t  CAP6;                            /*!< (@ 0x50004118) SCT capture register of capture channel 0 to
                                                         7; REGMOD0 to REGMODE7 = 1                                            */
    __IO uint32_t  MATCH6;                          /*!< (@ 0x50004118) SCT match value register of match channels 0
                                                         to 7; REGMOD0 to REGMODE7 = 0                                         */
  };
  
  union {
    __IO uint32_t  CAP7;                            /*!< (@ 0x5000411C) SCT capture register of capture channel 0 to
                                                         7; REGMOD0 to REGMODE7 = 1                                            */
    __IO uint32_t  MATCH7;                          /*!< (@ 0x5000411C) SCT match value register of match channels 0
                                                         to 7; REGMOD0 to REGMODE7 = 0                                         */
  };
  __IO uint32_t CAP[8];
  __IO uint32_t MATCH[8];
};
  __I  uint32_t  RESERVED2[56];
  
  union {
    struct {
  union {
    __IO uint32_t  CAPCTRL0;                        /*!< (@ 0x50004200) SCT capture control register 0 to 7; REGMOD0
                                                         = 1 to REGMODE7 = 1                                                   */
    __IO uint32_t  MATCHREL0;                       /*!< (@ 0x50004200) SCT match reload value register 0 to 7; REGMOD0
                                                         = 0 to REGMODE7 = 0                                                   */
  };
  
  union {
    __IO uint32_t  CAPCTRL1;                        /*!< (@ 0x50004204) SCT capture control register 0 to 7; REGMOD0
                                                         = 1 to REGMODE7 = 1                                                   */
    __IO uint32_t  MATCHREL1;                       /*!< (@ 0x50004204) SCT match reload value register 0 to 7; REGMOD0
                                                         = 0 to REGMODE7 = 0                                                   */
  };
  
  union {
    __IO uint32_t  CAPCTRL2;                        /*!< (@ 0x50004208) SCT capture control register 0 to 7; REGMOD0
                                                         = 1 to REGMODE7 = 1                                                   */
    __IO uint32_t  MATCHREL2;                       /*!< (@ 0x50004208) SCT match reload value register 0 to 7; REGMOD0
                                                         = 0 to REGMODE7 = 0                                                   */
  };
  
  union {
    __IO uint32_t  MATCHREL3;                       /*!< (@ 0x5000420C) SCT match reload value register 0 to 7; REGMOD0
                                                         = 0 to REGMODE7 = 0                                                   */
    __IO uint32_t  CAPCTRL3;                        /*!< (@ 0x5000420C) SCT capture control register 0 to 7; REGMOD0
                                                         = 1 to REGMODE7 = 1                                                   */
  };
  
  union {
    __IO uint32_t  CAPCTRL4;                        /*!< (@ 0x50004210) SCT capture control register 0 to 7; REGMOD0
                                                         = 1 to REGMODE7 = 1                                                   */
    __IO uint32_t  MATCHREL4;                       /*!< (@ 0x50004210) SCT match reload value register 0 to 7; REGMOD0
                                                         = 0 to REGMODE7 = 0                                                   */
  };
  
  union {
    __IO uint32_t  CAPCTRL5;                        /*!< (@ 0x50004214) SCT capture control register 0 to 7; REGMOD0
                                                         = 1 to REGMODE7 = 1                                                   */
    __IO uint32_t  MATCHREL5;                       /*!< (@ 0x50004214) SCT match reload value register 0 to 7; REGMOD0
                                                         = 0 to REGMODE7 = 0                                                   */
  };
  
  union {
    __IO uint32_t  CAPCTRL6;                        /*!< (@ 0x50004218) SCT capture control register 0 to 7; REGMOD0
                                                         = 1 to REGMODE7 = 1                                                   */
    __IO uint32_t  MATCHREL6;                       /*!< (@ 0x50004218) SCT match reload value register 0 to 7; REGMOD0
                                                         = 0 to REGMODE7 = 0                                                   */
  };
  
  union {
    __IO uint32_t  CAPCTRL7;                        /*!< (@ 0x5000421C) SCT capture control register 0 to 7; REGMOD0
                                                         = 1 to REGMODE7 = 1                                                   */
    __IO uint32_t  MATCHREL7;                       /*!< (@ 0x5000421C) SCT match reload value register 0 to 7; REGMOD0
                                                         = 0 to REGMODE7 = 0                                                   */
  };
  };
    __IO uint32_t  MATCHREL[8];
  };
  __I  uint32_t  RESERVED3[56];

