qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC82X/LPC82x.h
typedef struct {                                    /*!< (@ 0xA0000000) GPIO_PORT Structure                                    */
  __IO uint8_t   B0;                                /*!< (@ 0xA0000000) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B1;                                /*!< (@ 0xA0000001) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B2;                                /*!< (@ 0xA0000002) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B3;                                /*!< (@ 0xA0000003) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B4;                                /*!< (@ 0xA0000004) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B5;                                /*!< (@ 0xA0000005) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B6;                                /*!< (@ 0xA0000006) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B7;                                /*!< (@ 0xA0000007) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B8;                                /*!< (@ 0xA0000008) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B9;                                /*!< (@ 0xA0000009) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B10;                               /*!< (@ 0xA000000A) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B11;                               /*!< (@ 0xA000000B) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B12;                               /*!< (@ 0xA000000C) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B13;                               /*!< (@ 0xA000000D) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B14;                               /*!< (@ 0xA000000E) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B15;                               /*!< (@ 0xA000000F) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B16;                               /*!< (@ 0xA0000010) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B17;                               /*!< (@ 0xA0000011) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B18;                               /*!< (@ 0xA0000012) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B19;                               /*!< (@ 0xA0000013) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B20;                               /*!< (@ 0xA0000014) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B21;                               /*!< (@ 0xA0000015) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B22;                               /*!< (@ 0xA0000016) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B23;                               /*!< (@ 0xA0000017) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B24;                               /*!< (@ 0xA0000018) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B25;                               /*!< (@ 0xA0000019) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B26;                               /*!< (@ 0xA000001A) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B27;                               /*!< (@ 0xA000001B) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __IO uint8_t   B28;                               /*!< (@ 0xA000001C) Byte pin registers port 0; pins PIO0_0 to PIO0_28      */
  __I  uint8_t   RESERVED0[4067];
  __IO uint32_t  W0;                                /*!< (@ 0xA0001000) Word pin registers port 0                              */
  __IO uint32_t  W1;                                /*!< (@ 0xA0001004) Word pin registers port 0                              */
  __IO uint32_t  W2;                                /*!< (@ 0xA0001008) Word pin registers port 0                              */
  __IO uint32_t  W3;                                /*!< (@ 0xA000100C) Word pin registers port 0                              */
  __IO uint32_t  W4;                                /*!< (@ 0xA0001010) Word pin registers port 0                              */
  __IO uint32_t  W5;                                /*!< (@ 0xA0001014) Word pin registers port 0                              */
  __IO uint32_t  W6;                                /*!< (@ 0xA0001018) Word pin registers port 0                              */
  __IO uint32_t  W7;                                /*!< (@ 0xA000101C) Word pin registers port 0                              */
  __IO uint32_t  W8;                                /*!< (@ 0xA0001020) Word pin registers port 0                              */
  __IO uint32_t  W9;                                /*!< (@ 0xA0001024) Word pin registers port 0                              */
  __IO uint32_t  W10;                               /*!< (@ 0xA0001028) Word pin registers port 0                              */
  __IO uint32_t  W11;                               /*!< (@ 0xA000102C) Word pin registers port 0                              */
  __IO uint32_t  W12;                               /*!< (@ 0xA0001030) Word pin registers port 0                              */
  __IO uint32_t  W13;                               /*!< (@ 0xA0001034) Word pin registers port 0                              */
  __IO uint32_t  W14;                               /*!< (@ 0xA0001038) Word pin registers port 0                              */
  __IO uint32_t  W15;                               /*!< (@ 0xA000103C) Word pin registers port 0                              */
  __IO uint32_t  W16;                               /*!< (@ 0xA0001040) Word pin registers port 0                              */
  __IO uint32_t  W17;                               /*!< (@ 0xA0001044) Word pin registers port 0                              */
  __IO uint32_t  W18;                               /*!< (@ 0xA0001048) Word pin registers port 0                              */
  __IO uint32_t  W19;                               /*!< (@ 0xA000104C) Word pin registers port 0                              */
  __IO uint32_t  W20;                               /*!< (@ 0xA0001050) Word pin registers port 0                              */
  __IO uint32_t  W21;                               /*!< (@ 0xA0001054) Word pin registers port 0                              */
  __IO uint32_t  W22;                               /*!< (@ 0xA0001058) Word pin registers port 0                              */
  __IO uint32_t  W23;                               /*!< (@ 0xA000105C) Word pin registers port 0                              */
  __IO uint32_t  W24;                               /*!< (@ 0xA0001060) Word pin registers port 0                              */
  __IO uint32_t  W25;                               /*!< (@ 0xA0001064) Word pin registers port 0                              */
  __IO uint32_t  W26;                               /*!< (@ 0xA0001068) Word pin registers port 0                              */
  __IO uint32_t  W27;                               /*!< (@ 0xA000106C) Word pin registers port 0                              */
  __IO uint32_t  W28;                               /*!< (@ 0xA0001070) Word pin registers port 0                              */
  __I  uint32_t  RESERVED1[995];
  __IO uint32_t  DIR0;                              /*!< (@ 0xA0002000) Direction registers port 0                             */
  __I  uint32_t  RESERVED2[31];
  __IO uint32_t  MASK0;                             /*!< (@ 0xA0002080) Mask register port 0                                   */
  __I  uint32_t  RESERVED3[31];
  __IO uint32_t  PIN0;                              /*!< (@ 0xA0002100) Port pin register port 0                               */
  __I  uint32_t  RESERVED4[31];
  __IO uint32_t  MPIN0;                             /*!< (@ 0xA0002180) Masked port register port 0                            */
  __I  uint32_t  RESERVED5[31];
  __IO uint32_t  SET0;                              /*!< (@ 0xA0002200) Write: Set register for port 0 Read: output bits
                                                         for port 0                                                            */
  __I  uint32_t  RESERVED6[31];
  __O  uint32_t  CLR0;                              /*!< (@ 0xA0002280) Clear port 0                                           */
  __I  uint32_t  RESERVED7[31];
  __O  uint32_t  NOT0;                              /*!< (@ 0xA0002300) Toggle port 0                                          */
  __I  uint32_t  RESERVED8[31];
  __O  uint32_t  DIRSET0;                           /*!< (@ 0xA0002380) Set pin direction bits for port 0.                     */
  __I  uint32_t  RESERVED9[31];
  __O  uint32_t  DIRCLR0;                           /*!< (@ 0xA0002400) Clear pin direction bits for port 0.                   */
  __I  uint32_t  RESERVED10[31];
  __O  uint32_t  DIRNOT0;                           /*!< (@ 0xA0002480) Toggle pin direction bits for port 0.                  */
} LPC_GPIO_PORT_Type;


/* ================================================================================ */
/* ================                     PIN_INT                    ================ */
/* ================================================================================ */


/**
  * @brief Pin interrupt and pattern match engine (PIN_INT)
  */

