qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC82X/LPC82x.h
typedef struct {                                    /*!< (@ 0xA0004000) PIN_INT Structure                                      */
  __IO uint32_t  ISEL;                              /*!< (@ 0xA0004000) Pin Interrupt Mode register                            */
  __IO uint32_t  IENR;                              /*!< (@ 0xA0004004) Pin interrupt level or rising edge interrupt
                                                         enable register                                                       */
  __O  uint32_t  SIENR;                             /*!< (@ 0xA0004008) Pin interrupt level (rising edge) interrupt set
                                                         register                                                              */
  __O  uint32_t  CIENR;                             /*!< (@ 0xA000400C) Pin interrupt level or rising edge interrupt
                                                         clear register                                                        */
  __IO uint32_t  IENF;                              /*!< (@ 0xA0004010) Pin interrupt active level or falling edge interrupt
                                                         enable register                                                       */
  __O  uint32_t  SIENF;                             /*!< (@ 0xA0004014) Pin interrupt active level or falling edge interrupt
                                                         set register                                                          */
  __O  uint32_t  CIENF;                             /*!< (@ 0xA0004018) Pin interrupt active level (falling edge) interrupt
                                                         clear register                                                        */
  __IO uint32_t  RISE;                              /*!< (@ 0xA000401C) Pin interrupt rising edge register                     */
  __IO uint32_t  FALL;                              /*!< (@ 0xA0004020) Pin interrupt falling edge register                    */
  __IO uint32_t  IST;                               /*!< (@ 0xA0004024) Pin interrupt status register                          */
  __IO uint32_t  PMCTRL;                            /*!< (@ 0xA0004028) GPIO pattern match interrupt control register          */
  __IO uint32_t  PMSRC;                             /*!< (@ 0xA000402C) GPIO pattern match interrupt bit-slice source
                                                         register                                                              */
  __IO uint32_t  PMCFG;                             /*!< (@ 0xA0004030) GPIO pattern match interrupt bit slice configuration
                                                         register                                                              */
} LPC_PIN_INT_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif




/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define LPC_WWDT_BASE                   0x40000000UL
#define LPC_MRT_BASE                    0x40004000UL
#define LPC_WKT_BASE                    0x40008000UL
#define LPC_SWM_BASE                    0x4000C000UL
#define LPC_ADC_BASE                    0x4001C000UL
#define LPC_PMU_BASE                    0x40020000UL
#define LPC_CMP_BASE                    0x40024000UL
#define LPC_DMATRIGMUX_BASE             0x40028000UL
#define LPC_INPUTMUX_BASE               0x4002C000UL
#define LPC_FLASHCTRL_BASE              0x40040000UL
#define LPC_IOCON_BASE                  0x40044000UL
#define LPC_SYSCON_BASE                 0x40048000UL
#define LPC_I2C0_BASE                   0x40050000UL
#define LPC_I2C1_BASE                   0x40054000UL
#define LPC_SPI0_BASE                   0x40058000UL
#define LPC_SPI1_BASE                   0x4005C000UL
#define LPC_USART0_BASE                 0x40064000UL
#define LPC_USART1_BASE                 0x40068000UL
#define LPC_USART2_BASE                 0x4006C000UL
#define LPC_I2C2_BASE                   0x40070000UL
#define LPC_I2C3_BASE                   0x40074000UL
#define LPC_CRC_BASE                    0x50000000UL
#define LPC_SCT_BASE                    0x50004000UL
#define LPC_DMA_BASE                    0x50008000UL
#define LPC_GPIO_PORT_BASE              0xA0000000UL
#define LPC_PIN_INT_BASE                0xA0004000UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define LPC_WWDT                        ((LPC_WWDT_Type           *) LPC_WWDT_BASE)
#define LPC_MRT                         ((LPC_MRT_Type            *) LPC_MRT_BASE)
#define LPC_WKT                         ((LPC_WKT_Type            *) LPC_WKT_BASE)
#define LPC_SWM                         ((LPC_SWM_Type            *) LPC_SWM_BASE)
#define LPC_ADC                         ((LPC_ADC_Type            *) LPC_ADC_BASE)
#define LPC_PMU                         ((LPC_PMU_Type            *) LPC_PMU_BASE)
#define LPC_CMP                         ((LPC_CMP_Type            *) LPC_CMP_BASE)
#define LPC_DMATRIGMUX                  ((LPC_DMATRIGMUX_Type     *) LPC_DMATRIGMUX_BASE)
#define LPC_INPUTMUX                    ((LPC_INPUTMUX_Type       *) LPC_INPUTMUX_BASE)
#define LPC_FLASHCTRL                   ((LPC_FLASHCTRL_Type      *) LPC_FLASHCTRL_BASE)
#define LPC_IOCON                       ((LPC_IOCON_Type          *) LPC_IOCON_BASE)
#define LPC_SYSCON                      ((LPC_SYSCON_Type         *) LPC_SYSCON_BASE)
#define LPC_I2C0                        ((LPC_I2C0_Type           *) LPC_I2C0_BASE)
#define LPC_I2C1                        ((LPC_I2C0_Type           *) LPC_I2C1_BASE)
#define LPC_SPI0                        ((LPC_SPI0_Type           *) LPC_SPI0_BASE)
#define LPC_SPI1                        ((LPC_SPI0_Type           *) LPC_SPI1_BASE)
#define LPC_USART0                      ((LPC_USART0_Type         *) LPC_USART0_BASE)
#define LPC_USART1                      ((LPC_USART0_Type         *) LPC_USART1_BASE)
#define LPC_USART2                      ((LPC_USART0_Type         *) LPC_USART2_BASE)
#define LPC_I2C2                        ((LPC_I2C0_Type           *) LPC_I2C2_BASE)
#define LPC_I2C3                        ((LPC_I2C0_Type           *) LPC_I2C3_BASE)
#define LPC_CRC                         ((LPC_CRC_Type            *) LPC_CRC_BASE)
#define LPC_SCT                         ((LPC_SCT_Type            *) LPC_SCT_BASE)
#define LPC_DMA                         ((LPC_DMA_Type            *) LPC_DMA_BASE)
#define LPC_GPIO_PORT                   ((LPC_GPIO_PORT_Type      *) LPC_GPIO_PORT_BASE)
#define LPC_PIN_INT                     ((LPC_PIN_INT_Type        *) LPC_PIN_INT_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group LPC82x */
/** @} */ /* End of group (null) */

#ifdef __cplusplus
}
#endif


#endif  /* LPC82x_H */

